let StationData = {
    stations: [
        {
            id  : '1001',
            city: '0',
            name: '基隆',
            lat : 25.132301,
            long: 121.739466
        },
        {
            id  : '1002',
            city: '0',
            name: '八堵',
            lat : 25.108334,
            long: 121.729054
        },
        {
            id  : '1003',
            city: '0',
            name: '七堵',
            lat : 25.093365,
            long: 121.713995
        },
        {
            id  : '1004',
            city: '0',
            name: '五堵',
            lat : 25.077857,
            long: 121.66762
        },
        {
            id  : '1005',
            city: '0',
            name: '汐止',
            lat : 25.068315,
            long: 121.661734
        },
        {
            id  : '1810',
            city: '0',
            name: '福隆',
            lat : 25.015921,
            long: 121.94478
        },
        {
            id  : '1809',
            city: '0',
            name: '貢寮',
            lat : 25.022062,
            long: 121.90868
        },
        {
            id  : '1808',
            city: '0',
            name: '雙溪',
            lat : 25.038561,
            long: 121.866504
        },
        {
            id  : '1807',
            city: '0',
            name: '牡丹',
            lat : 25.058767,
            long: 121.851998
        },
        {
            id  : '1806',
            city: '0',
            name: '三貂嶺',
            lat : 25.065544,
            long: 121.822558
        },
        {
            id  : '1805',
            city: '0',
            name: '猴硐',
            lat : 25.087009,
            long: 121.827423
        },
        {
            id  : '1804',
            city: '0',
            name: '瑞芳',
            lat : 25.108927,
            long: 121.806148
         },
        {
            id  : '1803',
            city: '0',
            name: '四腳亭',
            lat : 25.10275,
            long: 121.761886
        },
        {
            id  : '1802',
            city: '0',
            name: '暖暖',
            lat : 25.10229,
            long: 21.74032
        },
        {
            id  : '1029',
            city: '0',
            name: '三坑',
            lat : 25.123052,
            long: 121.742016
        },
        {
            id  : '1030',
            city: '0',
            name: '百福',
            lat : 25.077924,
            long: 121.693623
        },
        {
            id  : '1031',
            city: '0',
            name: '汐科',
            lat : 25.062562,
            long: 121.64665
        },
        {
            id  : '1006',
            city: '0',
            name: '南港',
            lat : 25.053169,
            long: 121.607068
        },
        {
            id  : '1007',
            city: '0',
            name: '松山',
            lat : 25.049192,
            long: 121.577914
        },
        {
            id  : '1008',
            city: '0',
            name: '臺北',
            lat : 25.047923,
            long: 121.51708
        },
        {
            id  : '1009',
            city: '0',
            name: '萬華',
            lat : 25.033378,
            long: 121.500285
        },
        {
            id  : '1011',
            city: '0',
            name: '板橋',
            lat : 25.0140798,
            long: 121.464766
        },
        {
            id  : '1032',
            city: '0',
            name: '浮洲',
            lat : 25.004192,
            long: 121.444737
        },
        {
            id  : '1012',
            city: '0',
            name: '樹林',
            lat : 24.991407,
            long: 121.4246
        },
        {
            id  : '1013',
            city: '0',
            name: '山 佳',
            lat : 24.97248,
            long: 121.392614
        },
        {
            id  : '1014',
            city: '0',
            name: '鶯歌',
            lat : 24.954492,
            long: 121.355208
        },
         //桃園
        {
            id  : '1015',
            city: '1',
            name: '桃園',
            lat : 24.989206,
            long: 121.313548
        },
        {
            id  : '1016',
            city: '1',
            name: '內壢',
            lat : 24.972769,
            long: 121.258211
        },
        {
            id  : '1017',
            city: '1',
            name: '中壢',
            lat : 24.953635,
            long: 121.225648
        },
        {
            id  : '1018',
            city: '1',
            name: '埔心',
            lat : 24.919427,
            long: 121.183615
        },
        {
            id  : '1019',
            city: '1',
            name: '楊梅',
            lat : 24.914094,
            long: 121.146423
        },
        {
            id  : '1020',
            city: '1',
            name: '富岡',
            lat : 24.934427,
            long: 121.083067
        },
        //新竹
        {
            id  : '1021',
            city: '2',
            name: '湖口',
            lat : 24.902864,
            long: 121.044122
        },
        {
            id  : '1022',
            city: '2',
            name: '新豐',
            lat : 24.869687,
            long: 120.996838
        },
        {
            id  : '1023',
            city: '2',
            name: '竹北',
            lat : 24.839161,
            long: 121.009456
        },
        {
            id  : '1024',
            city: '2',
            name: '北新竹',
            lat : 24.808765,
            long: 120.983824
        },
        {
            id  : '1025',
            city: '2',
            name: '新竹',
            lat : 24.801643,
            long: 120.971695
        },
        {
            id  : '1026',
            city: '2',
            name: '香山',
            lat : 24.763127,
            long: 120.913874
        },
        {
            id  : '1033',
            city: '2',
            name: '北湖',
            lat : 24.922226,
            long: 121.055735
        },
        //苗栗
        {
            id  : '1027',
            city: '3',
            name: '崎頂',
            lat : 24.722878,
            long: 120.871892
        },
        {
            id  : '1028',
            city: '3',
            name: '竹南',
            lat : 24.68661,
            long: 20.880698
        },
        {
            id  : '1102',
            city: '3',
            name: '談文',
            lat : 24.656414,
            long: 120.858241
        },
        {
            id  : '1104',
            city: '3',
            name: '大山',
            lat : 24.645645,
            long: 120.803778
        },
        {
            id  : '1105',
            city: '3',
            name: '後龍',
            lat : 24.616212,
            long: 120.787307
        },
        {
            id  : '1106',
            city: '3',
            name: '龍港',
            lat : 24.611682,
            long: 120.758141
        },
        {
            id  : '1107',
            city: '3',
            name: '白沙屯',
            lat : 24.56479,
            long: 120.708197
        },
        {
            id  : '1108',
            city: '3',
            name: '新埔',
            lat : 24.540179,
            long: 120.695179
        },
        {
            id  : '1109',
            city: '3',
            name: '通霄',
            lat : 24.491403,
            long: 120.678424
        },
        {
            id  : '1110',
            city: '3',
            name: '苑裡',
            lat : 24.443425,
            long: 120.651493
        },
        {
            id  : '1302',
            city: '3',
            name: '造橋',
            lat : 24.641862,
            long: 120.867194
        },
        {
            id  : '1304',
            city: '3',
            name: '豐富',
            lat : 24.601128,
            long: 120.823548
        },
        {
            id  : '1305',
            city: '3',
            name: '苗栗',
            lat : 24.57002,
            long: 120.822343
        },
        {
            id  : '1307',
            city: '3',
            name: '南勢',
            lat : 24.52248,
            long: 120.791544
        },
        {
            id  : '1308',
            city: '3',
            name: '銅鑼',
            lat : 24.486339,
            long: 120.786172
        },
        {
            id  : '1310',
            city: '3',
            name: '三義',
            lat : 24.42062,
            long: 120.77393
        },
        //台中
        {
            id  : '1111',
            city: '4',
            name: '日南',
            lat : 24.378065,
            long: 120.654118
        },
        {
            id  : '1112',
            city: '4',
            name: '大甲',
            lat : 24.344429,
            long: 120.627017
        },
        {
            id  : '1113',
            city: '4',
            name: '臺中港',
            lat : 24.304388,
            long: 120.602303
        },
        {
            id  : '1114',
            city: '4',
            name: '清水',
            lat : 24.263623,
            long: 120.569178
        },
        {
            id  : '1115',
            city: '4',
            name: '沙鹿',
            lat : 24.237044,
            long: 120.557626
        },
        {
            id  : '1116',
            city: '4',
            name: '龍井',
            lat : 24.197443,
            long: 120.543371
        },
        {
            id  : '1117',
            city: '4',
            name: '大肚',
            lat : 24.154023,
            long: 120.542535
        },
        {
            id  : '1118',
            city: '4',
            name: '追分',
            lat : 24.120577,
            long: 120.570127
        },
        {
            id  : '1314',
            city: '4',
            name: '泰安',
            lat : 24.331291,
            long: 120.741816
        },
        {
            id  : '1315',
            city: '4',
            name: '后里',
            lat : 24.309312,
            long: 120.732892
        },
        {
            id  : '1317',
            city: '4',
            name: '豐原',
            lat : 24.254112,
            long: 120.722916
        },
        {
            id  : '1318',
            city: '4',
            name: '潭子',
            lat : 24.212824,
            long: 120.705571
        },
        {
            id  : '1323',
            city: '4',
            name: '太原',
            lat : 24.166682,
            long: 120.700084
        },
        {
            id  : '1319',
            city: '4',
            name: '臺中',
            lat : 24.13678,
            long: 120.685008
        },
        {
            id  : '1322',
            city: '4',
            name: '大慶',
            lat : 24.118875,
            long: 120.647897
        },
        {
            id  : '1320',
            city: '4',
            name: '烏日',
            lat : 24.108659,
            long: 120.622442
        },
        {
            id  : '1324',
            city: '4',
            name: '新烏日',
            lat : 24.109843,
            long: 120.613948
        },
        {
            id  : '1321',
            city: '4',
            name: '成功 ',
            lat : 24.114232,
            long: 120.590163
        },
        //彰化
        {
            id  : 1120,
            city: '5',
            name: '彰化',
            lat : 24.081665,
            long: 120.538539
        },
        {
            id  : 1202,
            city: '5',
            name: '花壇',
            lat : 24.024996,
            long: 120.537399
        },
        {
            id  : 1240,
            city: '5',
            name: '大村',
            lat : 23.990052,
            long: 120.560645
        },
        {
            id  : 1203,
            city: '5',
            name: '員林',
            lat : 23.959346,
            long: 120.56996
        },
        {
            id  : 1204,
            city: '5',
            name: '永靖',
            lat : 23.928147,
            long: 120.571672
        },
        {
            id  : 1205,
            city: '5',
            name: '社頭',
            lat : 23.89571,
            long: 120.5808
        },
        {
            id  : 1206,
            city: '5',
            name: '田中',
            lat : 23.858502,
            long: 120.591396
        },
        {
            id  : 1207,
            city: '5',
            name: '二水',
            lat : 23.81315,
            long: 120.618114
        },
        //南投
        {
            id  : 2702,
            city: '6',
            name: '源泉',
            lat : 23.798444,
            long: 120.642033
        },
        {
            id  : 2703,
            city: '6',
            name: '濁水',
            lat : 23.834664,
            long: 120.704719
        },
        {
            id  : 2704,
            city: '6',
            name: '龍泉',
            lat : 23.835188,
            long: 120.750403
        },
        {
            id  : 2705,
            city: '6',
            name: '集集',
            lat : 23.826451,
            long: 120.78489
        },
        {
            id  : 2706,
            city: '6',
            name: '水里',
            lat : 23.818455,
            long: 120.853322
        },
        {
            id  : 2707,
            city: '6',
            name: '車埕',
            lat : 23.832636,
            long: 120.865745
        },
        //雲林
        {
            id  : 1208,
            city: '7',
            name: '林內',
            lat : 23.75968,
            long: 120.614987
        },
        {
            id  : 1209,
            city: '7',
            name: '石榴',
            lat : 23.731722,
            long: 120.579971
        },
        {
            id  : 1210,
            city: '7',
            name: '斗六',
            lat : 23.7052606,
            long: 120.5717192
        },
        {
            id  : 1211,
            city: '7',
            name: '斗南',
            lat : 23.672971,
            long: 120.48084
        },
        {
            id  : 1212,
            city: '7',
            name: '石龜',
            lat : 23.639508,
            long: 120.471048
        },
        //嘉義
        {
            id  : 1213,
            city: '8',
            name: '大林',
            lat : 23.601076,
            long: 120.455839
        },
        {
            id  : 1214,
            city: '8',
            name: '民雄',
            lat : 23.555039,
            long: 120.431651
        },
        {
            id  : 1241,
            city: '8',
            name: '嘉北',
            lat : 23.499805,
            long: 120.448453
        },
        {
            id  : 1215,
            city: '8',
            name: '嘉義',
            lat : 23.479306,
            long: 120.440827
        },
        {
            id  : 1217,
            city: '8',
            name: '水上',
            lat : 23.433976,
            long: 120.399706
        },
        {
            id  : 1218,
            city: '8',
            name: '南靖',
            lat : 23.413433,
            long: 120.386539
        },
        //台南
        {
            id  : 1219,
            city: '9',
            name: '後壁',
            lat : 23.366246,
            long: 120.360603
        },
        {
            id  : 1220,
            city: '9',
            name: '新營',
            lat : 23.306731,
            long: 120.323055
        },
        {
            id  : 1221,
            city: '9',
            name: '柳營',
            lat : 23.277619,
            long: 120.322519
        },
        {
            id  : 1222,
            city: '9',
            name: '林鳳營',
            lat : 23.242592,
            long: 120.320972
        },
        {
            id  : 1223,
            city: '9',
            name: '隆田',
            lat : 23.192707,
            long: 120.319202
        },
        {
            id  : 1224,
            city: '9',
            name: '拔林',
            lat : 23.172291,
            long: 120.321185
        },
        {
            id  : 1225,
            city: '9',
            name: '善化',
            lat : 23.133323,
            long: 120.30655
        },
        {
            id  : 1244,
            city: '9',
            name: '南科',
            lat : 23.107024,
            long: 120.301923
        },
        {
            id  : 1226,
            city: '9',
            name: '新市',
            lat : 23.06819,
            long: 120.290043
        },
        {
            id  : 1227,
            city: '9',
            name: '永康',
            lat : 23.038337,
            long: 120.253523
        },
        {
            id  : 1239,
            city: '9',
            name: '大橋',
            lat : 23.019399,
            long: 120.22442
        },
        {
            id  : 1228,
            city: '9',
            name: '臺南',
            lat : 22.997144,
            long: 120.212966
        },
        {
            id  : 1229,
            city: '9',
            name: '保安',
            lat : 22.932952,
            long: 120.231635
        },
        {
            id  : 1243,
            city: '9',
            name: '仁德  ',
            lat : 22.9234,
            long: 120.240447
        },
        {
            id  : 1230,
            city: '9',
            name: '中洲',
            lat : 22.904025,
            long: 120.252898
        },
        {
            id  : 5101,
            city: '9',
            name: '長榮大學',
            lat : 22.90715,
            long: 120.272203
        },
        {
            id  : 5102,
            city: '9',
            name: '沙崙',
            lat : 22.923847,
            long: 120.286402
        },
        //高雄
        {
            id  : 1231,
            city: '10',
            name: '大湖',
            lat : 22.878186,
            long: 120.253941
        },
        {
            id  : 1232,
            city: '10',
            name: '路竹',
            lat : 22.85395,
            long: 120.266266
        },
        {
            id  : 1233,
            city: '10',
            name: '岡山',
            lat : 22.79227,
            long: 120.300019
        },
        {
            id  : 1234,
            city: '10',
            name: '橋頭',
            lat : 22.76084,
            long: 120.310187
        },
        {
            id  : 1235,
            city: '10',
            name: '楠梓',
            lat : 22.727035,
            long: 120.32437
        },
        {
            id  : 1242,
            city: '10',
            name: '新左',
            lat : 22.687544,
            long: 120.306787
        },
        {
            id  : 1236,
            city: '10',
            name: '左營',
            lat : 22.675873,
            long: 120.295452
        },
        {
            id  : 1238,
            city: '10',
            name: '高雄',
            lat : 22.639619,
            long: 120.30211
        },
        {
            id  : 1402,
            city: '10',
            name: '鳳山',
            lat : 22.631284,
            long: 120.357682
        },
        {
            id  : 1403,
            city: '10',
            name: '後庄',
            lat : 22.640163,
            long: 120.391313
        },
        {
            id  : 1404,
            city: '10',
            name: '九曲',
            lat : 22.656447,
            long: 120.420939
        },
        //屏東
        {
            id  : 1405,
            city: '11',
            name: '六塊厝',
            lat : 22.665986,
            long: 120.464995
        },
        {
            id  : 1406,
            city: '11',
            name: '屏東',
            lat : 22.669305,
            long: 120.486202
        },
        {
            id  : 1407,
            city: '11',
            name: '歸來',
            lat : 22.652222,
            long: 120.503011
        },
        {
            id  : 1408,
            city: '11',
            name: '麟洛',
            lat : 22.634819,
            long: 120.514367
        },
        {
            id  : 1409,
            city: '11',
            name: '西勢',
            lat : 22.616432,
            long: 120.526697
        },
        {
            id  : 1410,
            city: '11',
            name: '竹田',
            lat : 22.586464,
            long:120.539963
        },
        {
            id  : 1411,
            city: '11',
            name: '潮州',
            lat : 22.550085,
            long: 120.53642
        },
        {
            id  : 1412,
            city: '11',
            name: '崁頂',
            lat : 22.513074,
            long: 120.514796
        },
        {
            id  : 1413,
            city: '11',
            name: '南州',
            lat : 22.492058,
            long: 120.511738
        },
        {
            id  : 1414,
            city: '11',
            name: '鎮安',
            lat : 22.45793,
            long: 120.511222
        },
        {
            id  : 1415,
            city: '11',
            name: '林邊',
            lat : 22.431349,
            long: 120.515322
        },
        {
            id  : 1416,
            city: '11',
            name: '佳冬',
            lat : 22.414086,
            long: 120.547741
        },
        {
            id  : 1417,
            city: '11',
            name: '東海',
            lat : 22.398968,
            long: 120.572356
        },
        {
            id  : 1418,
            city: '11',
            name: '枋寮',
            lat : 22.368018,
            long: 120.595097
        },
        {
            id  : 1502,
            city: '11',
            name: '加祿',
            lat : 22.330971,
            long: 120.62462
        },
        {
            id  : 1503,
            city: '11',
            name: '內獅',
            lat : 22.306185,
            long: 120.643347
        },
        {
            id  : 1504,
            city: '11',
            name: '枋山',
            lat : 22.267061,
            long: 120.659503
        },
        //宜蘭
        {
            id  : 1507,
            city: '12',
            name: '古莊',
            lat : 22.345508,
            long: 120.878078
        },
        {
            id  : 1508,
            city: '12',
            name: '大武',
            lat : 22.365216,
            long: 120.900799
        },
        {
            id  : 1510,
            city: '12',
            name: '瀧溪',
            lat : 22.460981,
            long: 120.941792
        },
        {
            id  : 1512,
            city: '12',
            name: '金崙',
            lat : 22.531571,
            long: 120.967249
        },
        {
            id  : 1514,
            city: '12',
            name: '太麻里',
            lat : 22.618823,
            long: 121.005007
        },
        {
            id  : 1516,
            city: '12',
            name: '知本',
            lat : 22.710185,
            long: 121.060669
        },
        {
            id  : 1517,
            city: '12',
            name: '康樂',
            lat : 22.764274,
            long: 121.093555
        },
        {
            id  : 1632,
            city: '12',
            name: '臺東',
            lat : 22.7930164,
            long: 121.1227069
        },
        {
            id  : 1631,
            city: '12',
            name: '山里',
            lat : 22.862046,
            long: 121.13803
        },
        {
            id  : 1630,
            city: '12',
            name: '鹿野',
            lat : 22.912469,
            long: 121.137003
        },
        {
            id  : 1629,
            city: '12',
            name: '瑞源',
            lat : 22.955992,
            long: 121.158964
        },
        {
            id  : 1628,
            city: '12',
            name: '瑞和',
            lat : 22.979984,
            long: 121.155839
        },
        {
            id  : 1626,
            city: '12',
            name: '關山',
            lat : 23.045665,
            long: 121.164373
        },
        {
            id  : 1625,
            city: '12',
            name: '海端',
            lat : 23.102934,
            long: 121.176829
        },
        {
            id  : 1624,
            city: '12',
            name: '池上',
            lat : 23.126058,
            long: 121.219423
        },
        //花蓮
        {
            id  : 1623,
            city: '13',
            name: '富里',
            lat : 23.179131,
            long: 121.248691
        },
        {
            id  : 1622,
            city: '13',
            name: '東竹',
            lat : 23.226024,
            long: 121.27848
        },
        {
            id  : 1621,
            city: '13',
            name: '東里',
            lat : 23.272308,
            long: 121.304181
        },
        {
            id  : 1619,
            city: '13',
            name: '玉里',
            lat : 23.331517,
            long: 121.311725
        },
        {
            id  : 1617,
            city: '13',
            name: '三民',
            lat : 23.424534,
            long: 121.345403
        },
        {
            id  : 1616,
            city: '13',
            name: '瑞穗',
            lat : 23.497375,
            long: 121.376841
        },
        {
            id  : 1614,
            city: '13',
            name: '富源',
            lat : 23.580268,
            long: 121.380122
        },
        {
            id  : 1613,
            city: '13',
            name: '大富',
            lat : 23.605688,
            long: 121.389624
        },
        {
            id  : 1612,
            city: '13',
            name: '光復',
            lat : 23.666293,
            long: 121.421167
        },
        {
            id  : 1611,
            city: '13',
            name: '萬榮',
            lat : 23.711977,
            long: 121.419066
        },
        {
            id  : 1610,
            city: '13',
            name: '鳳林',
            lat : 23.746339,
            long: 121.447024
        },
        {
            id  : 1609,
            city: '13',
            name: '南平',
            lat : 23.782275,
            long: 121.45828
        },
        {
            id  : 1607,
            city: '13',
            name: '豐田',
            lat : 23.848475,
            long: 121.496167
        },
        {
            id  : 1606,
            city: '13',
            name: '壽豐',
            lat : 23.869015,
            long: 121.510632
        },
        {
            id  : 1605,
            city: '13',
            name: '平和',
            lat : 23.882774,
            long: 121.520485
        },
        {
            id  : 1604,
            city: '13',
            name: '志學',
            lat : 23.907493,
            long: 121.529436
        },
        {
            id  : 1602,
            city: '13',
            name: '吉安',
            lat : 23.968154,
            long: 121.58267
        },
        {
            id  : 1715,
            city: '13',
            name: '花蓮',
            lat : 23.993908,
            long: 121.6000958
        },
        {
            id  : 1714,
            city: '13',
            name: '北埔',
            lat : 24.032505,
            long: 121.601666
        },
        {
            id  : 1713,
            city: '13',
            name: '景美',
            lat : 24.090379,
            long: 121.610931
        },
        {
            id  : 1712,
            city: '13',
            name: '新城',
            lat : 24.127523,
            long: 121.640866
        },
        {
            id  : 1711,
            city: '13',
            name: '崇德',
            lat : 24.172134,
            long: 121.655497
        },
        {
            id  : 1710,
            city: '13',
            name: '和仁',
            lat : 24.242131,
            long: 121.712018
        },
        {
            id  : 1709,
            city: '13',
            name: '和平',
            lat : 24.298295,
            long: 121.753345
        },
        //宜蘭
        {
            id  : 1708,
            city: '14',
            name: '漢本',
            lat : 24.335428,
            long: 121.768354
        },
        {
            id  : 1706,
            city: '14',
            name: '武塔',
            lat : 24.448673,
            long: 121.776036
        },
        {
            id  : 1705,
            city: '14',
            name: '南澳',
            lat : 24.463396,
            long: 121.800926
        },
        {
            id  : 1704,
            city: '14',
            name: '東澳',
            lat : 24.51828,
            long: 121.830704
        },
        {
            id  : 1703,
            city: '14',
            name: '永樂',
            lat : 24.568417,
            long: 121.844564
        },
        {
            id  : 1827,
            city: '14',
            name: '蘇澳',
            lat : 24.59518,
            long: 121.85144
        },
        {
            id  : 1826,
            city: '14',
            name: '蘇澳新',
            lat : 24.6087,
            long: 121.827453
        },
        {
            id  : 1825,
            city: '14',
            name: '新馬',
            lat : 24.615395,
            long: 121.8229
        },
        {
            id  : 1824,
            city: '14',
            name: '冬山',
            lat : 24.636296,
            long: 121.792107
        },
        {
            id  : 1823,
            city: '14',
            name: '羅東',
            lat : 24.677928,
            long : 121.774629
        },
        {
            id  : 1822,
            city: '14',
            name: '中里',
            lat : 24.694165,
            long: 121.775255
        },
        {
            id  : 1821,
            city: '14',
            name: '二結',
            lat : 24.705267,
            long: 121.77413
        },
        {
            id  : 1820,
            city: '14',
            name: '宜蘭',
            lat : 24.7552252,
            long: 121.7583178
        },
        {
            id  : 1819,
            city: '14',
            name: '四城',
            lat : 24.786801,
            long: 121.762727
        },
        {
            id  : 1818,
            city: '14',
            name: '礁溪',
            lat : 24.8271,
            long: 121.775357
        },
        {
            id  : 1817,
            city: '14',
            name: '頂埔',
            lat : 24.843896,
            long: 121.80912
        },
        {
            id  : 1816,
            city: '14',
            name: '頭城',
            lat : 24.858975,
            long: 121.822555
        },
        {
            id  : 1815,
            city: '14',
            name: '外澳',
            lat : 24.883703,
            long: 121.845757
        },
        {
            id  : 1814,
            city: '14',
            name: '龜山',
            lat : 24.904818,
            long : 121.868878
        },
        {
            id  : 1813,
            city: '14',
            name: '大溪',
            lat : 24.93835,
            long: 121.889836
        },
        {
            id  : 1812,
            city: '14',
            name: '大里',
            lat : 24.966798,
            long: 121.922496
        },
        {
            id  : 1811,
            city: '14',
            name: '石城',
            lat : 24.978334,
            long: 121.945191
        },
        //平溪/深奧線
        {
            id  : 1908,
            city: '15',
            name: '菁桐',
            lat : 25.02388,
            long: 121.723722
        },
        {
            id  : 1907,
            city: '15',
            name: '平溪',
            lat : 25.025645,
            long : 121.740002
        },
        {
            id  : 1906,
            city: '15',
            name: '嶺腳',
            lat : 25.030099,
            long : 121.748102
        },
        {
            id  : 1905,
            city: '15',
            name: '望古',
            lat : 25.034495,
            long : 121.763751
        },
        {
            id  : 1904,
            city: '15',
            name: '十分',
            lat : 25.041153,
            long : 121.775162
        },
        {
            id  : 1903,
            city: '15',
            name: '大華',
            lat : 25.049913,
            long: 121.797543
        },
        {
            id  : 1806,
            city: '15',
            name: '三貂嶺',
            lat : 25.065544,
            long: 121.822558
        },
        {
            id  : 6103,
            city: '15',
            name: '海科館',
            lat : 25.137638,
            long: 121.80001

        },
        //內灣/六甲線
        {
            id  : 2212,
            city: '16',
            name: '千甲',
            lat : 24.806875,
            long: 121.002711
        },
        {
            id  : 2213,
            city: '16',
            name: '新莊',
            lat : 24.788158,
            long: 121.021856
        },
        {
            id  : 2203,
            city: '16',
            name: '竹中',
            lat : 24.781296,
            long: 121.031296
        },
        {
            id  : 2214,
            city: '16',
            name: '六家',
            lat : 24.807527,
            long: 121.0393
        },
        {
            id  : 2204,
            city: '16',
            name: '上員',
            lat : 24.777831,
            long: 121.055698
        },
        {
            id  : 2211,
            city: '16',
            name: '榮華',
            lat : 24.748484,
            long: 121.083006
        },
        {
            id  : 2205,
            city: '16',
            name: '竹東',
            lat : 24.738245,
            long: 121.094753
        },
        {
            id  : 2206,
            city: '16',
            name: '橫山',
            lat : 24.720563,
            long: 121.116546
        },
        {
            id  : 2208,
            city: '16',
            name: '合興',
            lat : 24.716709,
            long: 121.15439
        },
        {
            id  : 2209,
            city: '16',
            name: '富貴',
            lat : 24.715542,
            long: 121.167371
        },
        {
            id  : 2210,
            city: '16',
            name: '內灣',
            lat : 24.705302,
            long: 121.182556
        },
        {
            id  : 2207,
            city: '16',
            name: '九讚頭',
            lat : 24.72063,
            long: 121.136214
        },
        //集集線
        {
            id  : 1207,
            city: '17',
            name: '二水',
            lat : 23.8131611,
            long: 120.618203
        },
        {
            id  : 2702,
            city: '17',
            name: '源泉',
            lat : 23.7985051,
            long: 120.6422576
        },
        {
            id  : 2703,
            city: '17',
            name: '濁水',
            lat : 23.834664,
            long: 120.704719
        },
        {
            id  : 2704,
            city: '17',
            name: '龍泉',
            lat : 23.835188,
            long: 120.750403
        },
        {
            id  : 2705,
            city: '17',
            name: '集集',
            lat : 23.826451,
            long: 120.78489
        },
        {
            id  : 2706,
            city: '17',
            name: '水里',
            lat : 23.818455,
            long: 120.853322
        },
        {
            id  : 2707,
            city: '17',
            name: '車埕',
            lat : 23.832636,
            long: 120.865745
        },
        //沙崙線
        {
            id  : 5101,
            city: '18',
            name: '長榮大學',
            lat : 22.907332,
            long: 120.27266
        },
        {
            id  : 5102,
            city: '18',
            name: '沙崙',
            lat : 22.923847,
            long: 120.286402
        }
    ]
};

export default StationData;
