let TwtrafficStationData = {
    stations: [
        {
            id  : '1001',
            city: '0',
            name: '基隆',
            lat : 25.132301,
            long: 121.739466
        },
        {
            id  : '1002',
            city: '0',
            name: '八堵',
            lat : 25.108334,
            long: 121.729054
        },
        {
            id  : '1003',
            city: '0',
            name: '七堵',
            lat : 25.093365,
            long: 121.713995
        },
        {
            id  : '1004',
            city: '0',
            name: '五堵',
            lat : 25.077857,
            long: 121.66762
        },
        {
            id  : '1005',
            city: '0',
            name: '汐止',
            lat : 25.068315,
            long: 121.661734
        },
        {
            id  : '1810',
            city: '0',
            name: '福隆',
            lat : 25.015921,
            long: 121.94478
        },
        {
            id  : '1809',
            city: '0',
            name: '貢寮',
            lat : 25.022062,
            long: 121.90868
        },
        {
            id  : '1808',
            city: '0',
            name: '雙溪',
            lat : 25.038561,
            long: 121.866504
        },
        {
            id  : '1807',
            city: '0',
            name: '牡丹',
            lat : 25.058767,
            long: 121.851998
        },
        {
            id  : '1806',
            city: '0',
            name: '三貂嶺',
            lat : 25.065544,
            long: 121.822558
        },
        {
            id  : '1805',
            city: '0',
            name: '猴硐',
            lat : 25.087009,
            long: 121.827423
        },
        {
            id  : '1804',
            city: '0',
            name: '瑞芳',
            lat : 25.108927,
            long: 121.806148
         },
        {
            id  : '1803',
            city: '0',
            name: '四腳亭',
            lat : 25.10275,
            long: 121.761886
        },
        {
            id  : '1802',
            city: '0',
            name: '暖暖',
            lat : 25.10229,
            long: 21.74032
        },
        {
            id  : '1029',
            city: '0',
            name: '三坑',
            lat : 25.123052,
            long: 121.742016
        },
        {
            id  : '1030',
            city: '0',
            name: '百福',
            lat : 25.077924,
            long: 121.693623
        },
        {
            id  : '1031',
            city: '0',
            name: '汐科',
            lat : 25.062562,
            long: 121.64665
        },
        {
            id  : '1006',
            city: '0',
            name: '南港',
            lat : 25.053169,
            long: 121.607068
        },
        {
            id  : '1007',
            city: '0',
            name: '松山',
            lat : 25.049192,
            long: 121.577914
        },
        {
            id  : '1008',
            city: '0',
            name: '臺北',
            lat : 25.047923,
            long: 121.51708
        },
        {
            id  : '1009',
            city: '0',
            name: '萬華',
            lat : 25.033378,
            long: 121.500285
        },
        {
            id  : '1011',
            city: '0',
            name: '板橋',
            lat : 25.014051,
            long: 121.463814
        },
        {
            id  : '1032',
            city: '0',
            name: '浮洲',
            lat : 25.004192,
            long: 121.444737
        },
        {
            id  : '1012',
            city: '0',
            name: '樹林',
            lat : 24.991407,
            long: 121.4246
        },
        {
            id  : '1013',
            city: '0',
            name: '山 佳',
            lat : 24.97248,
            long: 121.392614
        },
        {
            id  : '1014',
            city: '0',
            name: '鶯歌',
            lat : 24.954492,
            long: 121.355208
        },
         //桃園
        {
            id  : '1015',
            city: '1',
            name: '桃園',
            lat : 24.989206,
            long: 121.313548
        },
        {
            id  : '1016',
            city: '1',
            name: '內壢',
            lat : 24.972769,
            long: 121.258211
        },
        {
            id  : '1017',
            city: '1',
            name: '中壢',
            lat : 24.953635,
            long: 121.225648
        },
        {
            id  : '1018',
            city: '1',
            name: '埔心',
            lat : 24.919427,
            long: 121.183615
        },
        {
            id  : '1019',
            city: '1',
            name: '楊梅',
            lat : 24.914094,
            long: 121.146423
        },
        {
            id  : '1020',
            city: '1',
            name: '富岡',
            lat : 24.934427,
            long: 121.083067
        },
        //新竹
        {
            id  : '1021',
            city: '2',
            name: '湖口',
            lat : 24.902864,
            long: 121.044122
        },
        {
            id  : '1022',
            city: '2',
            name: '新豐',
            lat : 24.869687,
            long: 120.996838
        },
        {
            id  : '1023',
            city: '2',
            name: '竹北',
            lat : 24.839161,
            long: 121.009456
        },
        {
            id  : '1024',
            city: '2',
            name: '北新竹',
            lat : 24.808765,
            long: 120.983824
        },
        {
            id  : '1025',
            city: '2',
            name: '新竹',
            lat : 24.801643,
            long: 120.971695
        },
        {
            id  : '1026',
            city: '2',
            name: '香山',
            lat : 24.763127,
            long: 120.913874
        },
        {
            id  : '1033',
            city: '2',
            name: '北湖',
            lat : 24.922226,
            long: 121.055735
        },
        //苗栗
        {
            id  : '1027',
            city: '3',
            name: '崎頂',
            lat : 24.722878,
            long: 120.871892
        },
        {
            id  : '1028',
            city: '3',
            name: '竹南',
            lat : 24.68661,
            long: 20.880698
        },
        {
            id  : '1102',
            city: '3',
            name: '談文',
            lat : 24.656414,
            long: 120.858241
        },
        {
            id  : '1104',
            city: '3',
            name: '大山',
            lat : 24.645645,
            long: 120.803778
        },
        {
            id  : '1105',
            city: '3',
            name: '後龍',
            lat : 24.616212,
            long: 120.787307
        },
        {
            id  : '1106',
            city: '3',
            name: '龍港',
            lat : 24.611682,
            long: 120.758141
        },
        {
            id  : '1107',
            city: '3',
            name: '白沙屯',
            lat : 24.56479,
            long: 120.708197
        },
        {
            id  : '1108',
            city: '3',
            name: '新埔',
            lat : 24.540179,
            long: 120.695179
        },
        {
            id  : '1109',
            city: '3',
            name: '通霄',
            lat : 24.491403,
            long: 120.678424
        },
        {
            id  : '1110',
            city: '3',
            name: '苑裡',
            lat : 24.443425,
            long: 120.651493
        },
        {
            id  : '1302',
            city: '3',
            name: '造橋',
            lat : 24.641862,
            long: 120.867194
        },
        {
            id  : '1304',
            city: '3',
            name: '豐富',
            lat : 24.601128,
            long: 120.823548
        },
        {
            id  : '1305',
            city: '3',
            name: '苗栗',
            lat : 24.57002,
            long: 120.822343
        },
        {
            id  : '1307',
            city: '3',
            name: '南勢',
            lat : 24.52248,
            long: 120.791544
        },
        {
            id  : '1308',
            city: '3',
            name: '銅鑼',
            lat : 24.486339,
            long: 120.786172
        },
        {
            id  : '1310',
            city: '3',
            name: '三義',
            lat : 24.42062,
            long: 120.77393
        },
        //台中
        {
            id  : '1111',
            city: '4',
            name: '日南',
            lat : 24.378065,
            long: 120.654118
        },
        {
            id  : '1112',
            city: '4',
            name: '大甲',
            lat : 24.344429,
            long: 120.627017
        },
        {
            id  : '1113',
            city: '4',
            name: '臺中港',
            lat : 24.304388,
            long: 120.602303
        },
        {
            id  : '1114',
            city: '4',
            name: '清水',
            lat : 24.263623,
            long: 120.569178
        },
        {
            id  : '1115',
            city: '4',
            name: '沙鹿',
            lat : 24.237044,
            long: 120.557626
        },
        {
            id  : '1116',
            city: '4',
            name: '龍井',
            lat : 24.197443,
            long: 120.543371
        },
        {
            id  : '1117',
            city: '4',
            name: '大肚',
            lat : 24.154023,
            long: 120.542535
        },
        {
            id  : '1118',
            city: '4',
            name: '追分',
            lat : 24.120577,
            long: 120.570127
        },
        {
            id  : '1314',
            city: '4',
            name: '泰安',
            lat : 24.331291,
            long: 120.741816
        },
        {
            id  : '1315',
            city: '4',
            name: '后里',
            lat : 24.309312,
            long: 120.732892
        },
        {
            id  : '1317',
            city: '4',
            name: '豐原',
            lat : 24.254112,
            long: 120.722916
        },
        {
            id  : '1318',
            city: '4',
            name: '潭子',
            lat : 24.212824,
            long: 120.705571
        },
        {
            id  : '1323',
            city: '4',
            name: '太原',
            lat : 24.166682,
            long: 120.700084
        },
        {
            id  : '1319',
            city: '4',
            name: '臺中',
            lat : 24.13678,
            long: 120.685008
        },
        {
            id  : '1322',
            city: '4',
            name: '大慶',
            lat : 24.118875,
            long: 120.647897
        },
        {
            id  : '1320',
            city: '4',
            name: '烏日',
            lat : 24.108659,
            long: 120.622442
        },
        {
            id  : '1324',
            city: '4',
            name: '新烏日',
            lat : 24.109843,
            long: 120.613948
        },
        {
            id  : '1321',
            city: '4',
            name: '成功 ',
            lat : 24.114232,
            long: 120.590163
        },
        //彰化
        {
            id  : 1120,
            city: '5',
            name: '彰化',
            lat : 24.081665,
            long: 120.538539
        },
        {
            id  : 1202,
            city: '5',
            name: '花壇',
            lat : 24.024996,
            long: 120.537399
        },
        {
            id  : 1240,
            city: '5',
            name: '大村',
            lat : 23.990052,
            long: 120.560645
        },
        {
            id  : 1203,
            city: '5',
            name: '員林',
            lat : 23.959346,
            long: 120.56996
        },
        {
            id  : 1204,
            city: '5',
            name: '永靖',
            lat : 23.928147,
            long: 120.571672
        },
        {
            id  : 1205,
            city: '5',
            name: '社頭',
            lat : 23.89571,
            long: 120.5808
        },
        {
            id  : 1206,
            city: '5',
            name: '田中',
            lat : 23.858502,
            long: 120.591396
        },
        {
            id  : 1207,
            city: '5',
            name: '二水',
            lat : 23.81315,
            long: 120.618114
        },
        //南投
        {
            id  : 2702,
            city: '6',
            name: '源泉',
            lat : 23.798444,
            long: 120.642033
        },
        {
            id  : 2703,
            city: '6',
            name: '濁水',
            lat : 23.834664,
            long: 120.704719
        },
        {
            id  : 2704,
            city: '6',
            name: '龍泉',
            lat : 23.835188,
            long: 120.750403
        },
        {
            id  : 2705,
            city: '6',
            name: '集集',
            lat : 23.826451,
            long: 120.78489
        },
        {
            id  : 2706,
            city: '6',
            name: '水里',
            lat : 23.818455,
            long: 120.853322
        },
        {
            id  : 2707,
            city: '6',
            name: '車埕',
            lat : 23.832636,
            long: 120.865745
        },
        //雲林
        {
            id  : 1208,
            city: '7',
            name: '林內',
            lat : 23.75968,
            long: 120.614987
        },
        {
            id  : 1209,
            city: '7',
            name: '石榴',
            lat : 23.731722,
            long: 120.579971
        },
        {
            id  : 1210,
            city: '7',
            name: '斗六',
            lat : 23.7052606,
            long: 120.5717192
        },
        {
            id  : 1211,
            city: '7',
            name: '斗南',
            lat : 23.672971,
            long: 120.48084
        },
        {
            id  : 1212,
            city: '7',
            name: '石龜',
            lat : 23.639508,
            long: 120.471048
        },
        //嘉義
        {
            id  : 1213,
            city: '8',
            name: '大林',
            lat : 23.601076,
            long: 120.455839
        },
        {
            id  : 1214,
            city: '8',
            name: '民雄',
            lat : 23.555039,
            long: 120.431651
        },
        {
            id  : 1241,
            city: '8',
            name: '嘉北',
            lat : 23.499805,
            long: 120.448453
        },
        {
            id  : 1215,
            city: '8',
            name: '嘉義',
            lat : 23.479306,
            long: 120.440827
        },
        {
            id  : 1217,
            city: '8',
            name: '水上',
            lat : 23.433976,
            long: 120.399706
        },
        {
            id  : 1218,
            city: '8',
            name: '南靖',
            lat : 23.413433,
            long: 120.386539
        },
        //台南
        {
            id  : 1219,
            city: '9',
            name: '後壁',
            lat : 23.366246,
            long: 120.360603
        },
        {
            id  : 1220,
            city: '9',
            name: '新營',
            lat : 23.306731,
            long: 120.323055
        },
        {
            id  : 1221,
            city: '9',
            name: '柳營',
            lat : 23.277619,
            long: 120.322519
        },
        {
            id  : 1222,
            city: '9',
            name: '林鳳營',
            lat : 23.242592,
            long: 120.320972
        },
        {
            id  : 1223,
            city: '9',
            name: '隆田',
            lat : 23.192707,
            long: 120.319202
        },
        {
            id  : 1224,
            city: '9',
            name: '拔林',
            lat : 23.172291,
            long: 120.321185
        },
        {
            id  : 1225,
            city: '9',
            name: '善化',
            lat : 23.133323,
            long: 120.30655
        },
        {
            id  : 1244,
            city: '9',
            name: '南科',
            lat : 23.107024,
            long: 120.301923
        },
        {
            id  : 1226,
            city: '9',
            name: '新市',
            lat : 23.06819,
            long: 120.290043
        },
        {
            id  : 1227,
            city: '9',
            name: '永康',
            lat : 23.038337,
            long: 120.253523
        },
        {
            id  : 1239,
            city: '9',
            name: '大橋',
            lat : 23.019399,
            long: 120.22442
        },
        {
            id  : 1228,
            city: '9',
            name: '臺南',
            lat : 22.997144,
            long: 120.212966
        },
        {
            id  : 1229,
            city: '9',
            name: '保安',
            lat : 22.932952,
            long: 120.231635
        },
        {
            id  : 1243,
            city: '9',
            name: '仁德  ',
            lat : 22.9234,
            long: 120.240447
        },
        {
            id  : 1230,
            city: '9',
            name: '中洲',
            lat : 22.904025,
            long: 120.252898
        },
        {
            id  : 5101,
            city: '9',
            name: '長榮大學',
            lat : 22.90715,
            long: 120.272203
        },
        {
            id  : 5102,
            city: '9',
            name: '沙崙',
            lat : 22.923847,
            long: 120.286402
        },
        //高雄
        {
            id  : 1231,
            city: '10',
            name: '大湖',
            lat : 22.878186,
            long: 120.253941
        },
        {
            id  : 1232,
            city: '10',
            name: '路竹',
            lat : 22.85395,
            long: 120.266266
        },
        {
            id  : 1233,
            city: '10',
            name: '岡山',
            lat : 22.79227,
            long: 120.300019
        },
        {
            id  : 1234,
            city: '10',
            name: '橋頭',
            lat : 22.76084,
            long: 120.310187
        },
        {
            id  : 1235,
            city: '10',
            name: '楠梓',
            lat : 22.727035,
            long: 120.32437
        },
        {
            id  : 1242,
            city: '10',
            name: '新左',
            lat : 22.687544,
            long: 120.306787
        },
        {
            id  : 1236,
            city: '10',
            name: '左營',
            lat : 22.675873,
            long: 120.295452
        },
        {
            id  : 1238,
            city: '10',
            name: '高雄',
            lat : 22.639619,
            long: 120.30211
        },
        {
            id  : 1402,
            city: '10',
            name: '鳳山',
            lat : 22.631284,
            long: 120.357682
        },
        {
            id  : 1403,
            city: '10',
            name: '後庄',
            lat : 22.640163,
            long: 120.391313
        },
        {
            id  : 1404,
            city: '10',
            name: '九曲',
            lat : 22.656447,
            long: 120.420939
        }
    ]
};

export default TwtrafficStationData;
